Revit 2025 API
SunStudyTimeInterval Enumeration
 Time interval enum for a single or multi-day sun study.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum SunStudyTimeInterval
Public Enumeration SunStudyTimeInterval
public enum class SunStudyTimeInterval
type SunStudyTimeInterval
Members
Member name | Value | Description
Minutes15 | 0 |  Interval occurs every 15 minutes.
Minutes30 | 1 |  Interval occurs every 30 minutes.
Minutes45 | 2 |  Interval occurs every 45 minutes.
Hour | 3 |  Interval occurs every hour.
Day | 4 |  Interval occurs every day.
Week | 5 |  Interval occurs once a week.
Month | 6 |  Interval occurs once a month.
Minute | -1 |  Interval occurs every minute.
Seconds45 | -2 |  Interval occurs every 45 seconds.
Seconds30 | -3 |  Interval occurs every 30 seconds.
Seconds15 | -4 |  Interval occurs every 15 seconds.
See Also
Reference
Autodesk.Revit.DB Namespace